import sys
import logging

import pandas as pd

sys.path.extend(['..', '.'])
import kis_auth as ka
from domestic_stock_functions import *

# 로깅 설정
logging.basicConfig(level=logging.INFO, format='%(levelname)s - %(message)s')
logger = logging.getLogger(__name__)

# 인증
ka.auth()
trenv = ka.getTREnv()

##############################################################################################
# [국내주식] 업종/기타 > 국내휴장일조회[국내주식-040]
# 오늘날짜 받아오기 
# 휴장일 조회
# 휴장일이면 프로세스 종료
##############################################################################################

result = chk_holiday(bass_dt="20250630")
print(result)

##############################################################################################
# [국내주식] 시세분석 > 국내기관_외국인 매매종목가집계[국내주식-037]
# 외국인 매매종목 1~5위 불러와서 종목 세팅하기
##############################################################################################

result = foreign_institution_total(
    fid_cond_mrkt_div_code="V",
    fid_cond_scr_div_code="16449",
    fid_input_iscd="0000",
    fid_div_cls_code="0",
    fid_rank_sort_cls_code="0",
    fid_etc_cls_code="0"
)
print(result)

##############################################################################################
# [해외주식] 기본시세 > 해외주식 종목_지수_환율기간별시세(일_주_월_년)[v1_해외주식-012]
# 오늘의 환율 정보 가져오기 
# 나중에 실시간 환율 정보로 바꿀 예정 
##############################################################################################

df1, df2 = inquire_daily_chartprice(fid_cond_mrkt_div_code="N", fid_input_iscd=".DJI", fid_input_date_1="20250101", fid_input_date_2="20250131", fid_period_div_code="D", env_dv="real")
print(df1)
print(df2)

##############################################################################################
# [국내주식] 실시간시세 > 국내주식 실시간체결가 (통합)
# 세팅한 종목의 실시간 시세 가져오기 
##############################################################################################

kws.subscribe(request=ccnl_total, data=["005930", "000660"])
	

##############################################################################################
# 세팅한 종목의 USD 가격 계산하기
##############################################################################################


##############################################################################################
# 살지 말지 결정하기
##############################################################################################


##############################################################################################
# [국내주식] 주문/계좌 > 매수가능조회[v1_국내주식-007]
# 매수 시그널이 오면 
##############################################################################################
    
result = inquire_psbl_order(env_dv="real", cano=trenv.my_acct, acnt_prdt_cd=trenv.my_prod, pdno="005930",
                            ord_unpr="55000",
                            ord_dvsn="01", cma_evlu_amt_icld_yn="N", ovrs_icld_yn="N")
print(result)


##############################################################################################
# [국내주식] 주문/계좌 > 주식주문(현금)[v1_국내주식-001]
# 주문 넣기
##############################################################################################

result = order_cash(env_dv="real", ord_dv="sell", cano=trenv.my_acct, acnt_prdt_cd=trenv.my_prod, pdno="005930",
                    ord_dvsn="00", ord_qty="1", ord_unpr="2000", excg_id_dvsn_cd="SOR")
print(result)


##############################################################################################
# [국내주식] 주문/계좌 > 주식일별주문체결조회[v1_국내주식-005]
# 체결 될 때까지 지켜보기
##############################################################################################

result1, result2 = inquire_daily_ccld(
    env_dv="real",
    pd_dv="inner",
    cano=trenv.my_acct,
    acnt_prdt_cd=trenv.my_prod,
    inqr_strt_dt="20220810",
    inqr_end_dt="20220810",
    sll_buy_dvsn_cd="00",
    inqr_dvsn="00",
    pdno="005930",
    ccld_dvsn="00",
    inqr_dvsn_3="00"
)
print(result1)
print(result2)

##############################################################################################
# [국내주식] 주문/계좌 > 주식잔고조회[v1_국내주식-006]
# 체결되며 잔고조회하기
##############################################################################################

result1, result2 = inquire_balance(
    env_dv="real",
    cano=trenv.my_acct,
    acnt_prdt_cd=trenv.my_prod,
    afhr_flpr_yn="N",
    inqr_dvsn="01",
    unpr_dvsn="01",
    fund_sttl_icld_yn="N",
    fncg_amt_auto_rdpt_yn="N",
    prcs_dvsn="00"
)
print(result1)
print(result2)

##############################################################################################
# [국내주식] 주문/계좌 > 주식잔고조회_실현손익[v1_국내주식-041]
# 실현 손익  확인하기 
##############################################################################################

result1, result2 = inquire_balance_rlz_pl(
    cano=trenv.my_acct,
    acnt_prdt_cd=trenv.my_prod,
    afhr_flpr_yn="N",
    inqr_dvsn="02",
    unpr_dvsn="01",
    fund_sttl_icld_yn="N",
    fncg_amt_auto_rdpt_yn="N",
    prcs_dvsn="01",
    cost_icld_yn="N"
)
print(result1)
print(result2)

##############################################################################################
# 실현손익의  USD 가격 계산하기
##############################################################################################


##############################################################################################
# 팔지 말지 결정하기
##############################################################################################


